Revit 2024 API
FabricationPart.ConnectorManager Property
 The connector manager of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ConnectorManager ConnectorManager { get; }
Visual Basic
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
Visual C++
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace